# Reading data from different file formats

In [7]:
import pandas as pd
import numpy as np

df1 = pd.read_csv('Kaggle_Titanic_csv.csv') # Read from csv file
df2 = pd.read_excel('Kaggle_Titanic_excel.xlsx') # Read from excel file
df3 = pd.read_json('Kaggle_Titanic_json.json') # Read from json file

# Read tables from a URL
dfs = pd.read_html('https://en.wikipedia.org/wiki/List_of_state_and_union_territory_capitals_in_India', header=0)
# "header=0" uses the first row of the table as the header

# Above command reads all the tables and providea a "list" of tables. Select the one you want as shown below
df4 = dfs[1]

# Viewing the dataframe (df)

In [8]:
df1.shape # Number of rows and columns
df1.shape[0] # Number of rows
len(df1) # same as above
df1.shape[1] # Number of columns

df1.size # Number of entries/cells in the df

df1.columns # Column names

df1.head(3) # Display first 3 rows of the df
df1.tail(3) # Display last 3 rows of the df

df1.info() # General info about the df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 11 columns):
PassengerId    200 non-null int64
Pclass         200 non-null int64
Name           200 non-null object
Sex            200 non-null object
Age            160 non-null float64
SibSp          200 non-null int64
Parch          200 non-null int64
Ticket         200 non-null object
Fare           199 non-null float64
Cabin          45 non-null object
Embarked       200 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 17.3+ KB

# Cleaning the data

In [9]:
# df1.columns = ['Col1','Col2','Col3'] # Rename all the columns of a dataframe
df1.rename(columns = {'Pclass':'Class', 'Fare':'Price'}) # Rename selected columns

df1['Pclass'].unique() # unique values present in a column

df1.isnull() # Returns a dataframe containing boolean values (True if NaN)
df1.notnull() # Opposite of df.isnull()

df1.isnull().any() # Tells whether a column has missing values. More useful than "df.isnull()"
df1.isnull().sum() # Gives the number of missing entries in each column

df1.dropna() # Drop ROWS having missing values
df1.dropna(axis=1) # Drop COLUMNS having missing values

df1['Age'].fillna(10) # Fill the blanks in 'Age' columns with 10
df1['Age'].fillna(df1['Age'].median()) # Fill the blanks in 'Age' columns with its median value

df1.drop_duplicates() # Drop duplicate rows

df1['Pclass'].replace(1,'A') #  Replace values in a column
df1['Pclass'].replace([2,3],['B','C'])

# Convert data type
print("\n PassengerID data type before = ", df1['Age'].dtype, " and after = ", df1['Age'].astype(float).dtype)

 PassengerID data type before =  float64  and after =  float64

# Statistics

**df.describe()** : Summary of statistics

**df.count()** : Count of numerical values in each column

**df.max()** : Maximum value in each column

**df.min()** : Miniimum value in each column

**df.mean()** : Mean value in each column

**df.median()** : Median value in each column

**df.var()** : Variance in each column

**df.std()** : Standard deviation in each column

**df.corr()** : Correlation coefficient between different columns

# Selection and subset dataframes

In [10]:
# SELECTION by POSITION (only integer values)
df1.iloc[0,:] # Entire 1st row
df1.iloc[0] # same as above
df1.iloc[0:3,:] # First two rows

df1.iloc[:,0] # Entire 1st column
df1.iloc[0,0] # Element of 1st row and 1st column
df1.iloc[:,-2:] # Last two columns


# SELECTION by LABELS/INDEX
df1.loc[1,:] # Entire row with index '1' (2nd row)
df1.loc[1] # same as above
df1.loc[:,'Age'] # 'Age' column
df1.loc[0,'Age'] # First element of 'Age' column
df1.loc[:,'Age':'Fare'] # columns from 'Age' till 'Fare'


# SUBSETS
df1['Age'] # subset dataframe containing only 'Age' column
df1.Age # same as above
df1_a = df1[['Age','Fare']] # subset dataframe containing 'Age' & 'Fare' columns

# Select columns whose name contains certain letters
df1.filter(regex='Id$') # Column names ENDING with "Id"
df1.filter(regex='^P') # Column names BEGINNING with "P"

df1[(df1.Age>10) & (df1.Age<50)] # Select rows whose 'Age' > 10 AND <50
df1.loc[(df1.Age>10) & (df1.Age<50)] # Same as above
df1.loc[df1.Age>10, ['Pclass', 'Fare']] # Select rows whose 'Age' > 10 AND only Pclass & Fare columns

df1.sample(frac=0.5, random_state = 7) # Randomly select 50% of the rows. 
df1.sample(n=4, random_state = 13) # Randomly select 4 rows
# Set the random_state to some value to produce repeatable results

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
179,1071,1,"Compton, Mrs. Alexander Taylor (Mary Eliza Ing...",female,64.0,0,2,PC 17756,83.1583,E45,C
155,1047,3,"Duquemin, Mr. Joseph",male,24.0,0,0,S.O./P.P. 752,7.5500,NaN,S
23,915,1,"Williams, Mr. Richard Norris II",male,21.0,0,1,PC 17597,61.3792,NaN,C
159,1051,3,"Peacock, Mrs. Benjamin (Edith Nile)",female,26.0,0,2,SOTON/O.Q. 3101315,13.7750,NaN,S

# Modifying df

In [11]:
df1.transpose() # Transpose the dataframe

df1['Fare By Age'] = df1['Fare']/df1.Age # ADD new columns

df1.drop('Fare By Age', axis=1, inplace=True) # "inplace=True" deletes column in df1.  
df1_b = df1.drop(['Name','Ticket','Cabin'], axis=1) # Drop the given columns and display (but does not delete it from df1)

df1_b.drop(df1_b.index[-2:], inplace=True) # drop last two rows (default axis=0 => drop rows)

df1.sort_values('Age') # sort rows based on Age (low to high)
df1.sort_values('Age', ascending=False) # sort rows based on Age (high to low)

df1.reset_index(drop=True) # gives new indices in ascending order from 0
df1.reset_index() # By default "ddf1.drop(['Name','Ticket','Cabin'], axis=1)rop=False" => the existing index is used as another column


# Just "df1.groupby('Sex')" produces an object, not a dataframe.
# Uses any statistical function mentioned above to get a dataframe

df1.groupby('Sex').mean() # use 'Sex' as index abd calculate mean of other columns
df1.groupby('Sex').agg(np.mean) # same as above. Functions not available in Pandas can be applied using "agg()" 

df1.groupby(['Sex','Pclass']).median() # use 'Sex' and 'Pclass' as indices and calculate median of other columns

# Use 'Sex' as an index and calculate median of only 'Pclass' and 'Fare' columns
df1.groupby('Sex')['Pclass','Fare'].median() 
df1.pivot_table(index='Sex', values=['Pclass','Fare'], aggfunc=np.median)

            Fare  Pclass
Sex
female  21.00000       3
male    13.20835       3

# append, concat, join, merge
**append()** is a special case of **concat()** . If you don't want to remember too many functions, forget **append()**.

**merge()** and **join()** are for SQL-style JOINing operations of TWO dataframes. (See the comparison with SQL here: https://pandas.pydata.org/pandas-docs/stable/comparison_with_sql.html#compare-with-sql-join ) 

**join()** is much more convenient and is applicable for dataframes having different indices. However, one can just forget **join()** and get the job done with **merge()** .

Information about the differences between these functions are available at:
<br>
1) https://www.reddit.com/r/learnpython/comments/6986nd/difference_between_concatenate_append_merge_in/
<br>
2) http://py-tut.blogspot.in/2016/11/pandas-concat-and-append.html

Graphical explanations about:
<br>
1) merge: https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf
<br>
2) All functions: https://pandas.pydata.org/pandas-docs/stable/merging.html

In [12]:
df_big = pd.concat([df1,df2,df3], ignore_index=True) # Join three dfs along rows (similar to append() function)

# "axis=1" => Join dataframes along columns
df1_union = pd.concat([df1_a,df1_b], axis=1) # Default join => NaN in place of missing rows/columns 
df1_intersect = pd.concat([df1_a,df1_b], axis=1, join='inner')

print("shapes of dataframes before concat =", df1_a.shape, df1_b.shape)
print("shapes of dataframes after (default i.e 'outer'/union) concat =", df1_union.shape)
print("shapes of dataframes after 'inner' (intersection) concat =", df1_intersect.shape)

shapes of dataframes before concat = (200, 2) (198, 8)
shapes of dataframes after (default i.e 'outer'/union) concat = (200, 10)
shapes of dataframes after 'inner' (intersection) concat = (198, 10)

# Writing data to different file formats

In [13]:
# Writing to a csv file
df2.to_csv('Output_csv.csv', index=False) 
# "index=False" avoids the extra "unnamed:0" column

# Writing to an excel file
xl_filename = pd.ExcelWriter('Output_excel.xlsx')
df2.to_excel(xl_filename, 'Titanic data', index=False)
xl_filename.save()

# Writing to a json file
df2 = df2.to_json(orient='records', force_ascii=False, date_format='iso')
with open('Output_json.json', 'w') as f:
    f.write(df2)

# References

1) https://www.dataquest.io/blog/pandas-cheat-sheet/
    
2) https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf

NOTE: The data used here is the Titanic dataset from Kaggle